Функция ПолучитьНастройки() Экспорт
    СткНастройки = Новый Структура("АдресУстройства,Логин,Пароль,Порт,ИспользоватьSSL,Логирование");
	Настройки = Справочники.isc_Настройки.НайтиПоКоду("000000001");
	Если Не ЗначениеЗаполнено(Настройки) Тогда
		Настройки = Справочники.isc_Настройки.СоздатьЭлемент();
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Length";
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Height";
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Width";
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Weight";
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Объем";

		Настройки.Записать();
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(СткНастройки, Настройки);
	СткНастройки.Вставить("МетодыХранения",Настройки.МетодыХранения.Выгрузить());
	СткНастройки.Вставить("СоответствиеУпаковок",Настройки.СоответствиеУпаковок.Выгрузить());
	Возврат СткНастройки;
КонецФункции


Процедура СохранитьНастройки(сткНастройки) Экспорт

	Настройки = Справочники.isc_Настройки.НайтиПоКоду("000000001");
	Если Не ЗНачениеЗаполнено(Настройки) Тогда
		Настройки = Справочники.isc_Настройки.СоздатьЭлемент();
		Настройки.Код = "000000001";
	Иначе
		Настройки = Настройки.ПолучитьОбъект();
	КонецЕсли;	
		ЗаполнитьЗначенияСвойств(Настройки, СткНастройки);
		Настройки.МетодыХранения.Загрузить(сткНастройки.МетодыХранения.Выгрузить());
		Настройки.СоответствиеУпаковок.Загрузить(сткНастройки.СоответствиеУпаковок.Выгрузить());
	    Настройки.Записать();
	Сообщить("Настройки сохранены!");
КонецПроцедуры

Функция УстановитьСоединениеНаСервере(ТестСоединения = Истина, ЧитатьИсторию = Ложь, ПараметрыПодключения = Неопределено) Экспорт
	Если  ПараметрыПодключения = Неопределено Тогда
		ПараметрыПодключения = ПолучитьНастройки();
	КонецЕсли;	
	Если ЧитатьИсторию Тогда
		СтраницаСервера	  = "/api/history";
	Иначе         
		СтраницаСервера = "/api/data";
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(
	ПараметрыПодключения.АдресУстройства, //"89.175.58.20", // сервер (хост)
	ПараметрыПодключения.Порт, //60080, // порт, по умолчанию для http используется 80, для https 443
	ПараметрыПодключения.Логин,  //"user", // пользователь для доступа к серверу (если он есть)
	ПараметрыПодключения.Пароль, //"user", // пароль для доступа к серверу (если он есть)
	, // здесь указывается прокси, если он есть
	, // таймаут в секундах, 0 или пусто - не устанавливать
	?(ПараметрыПодключения.ИспользоватьSSL,Новый  ЗащищенноеСоединениеOpenSSL(), Неопределено)// защищенное соединение, если используется https
	);
	Запрос = Новый HTTPЗапрос(СтраницаСервера);//"/data");
	Попытка
		Результат = Соединение.Получить(Запрос);
	Исключение
		Возврат Ложь;	
	КонецПопытки;	
	Возврат ?(ТестСоединения, Результат.КодСостояния = 200 ,Результат.ПолучитьТелоКакПоток());	
КонецФункции
